Repository: mkappus1/DatenmanagementMTHS24
Catalog: Woche 2/Skripte/TMX-EN-DE/tmx_teil_3.tmx
Source language: de
Languages: en

source: Lesezeichen aus Edelmetall
en: Book markers of precious metal

source: Musterkarten für Farben
en: Colour sample cards

source: Referenzhandbücher für Computerhardware
en: Computer hardware reference manuals

source: Landkarten aus biegsamen Kunststoffen
en: Maps made of flexible plastics

source: Selbstklebebänder für Schreibwaren
en: Self-adhesive tapes for stationery use

source: Luftdichte Verpackungen aus Pappe
en: Airtight packaging of cardboard

source: Winkelführer [Zeicheninstrument]
en: Angle guides [drawing instruments]

source: Steatit [Schneiderkreide]
en: Steatite [tailor's chalk]

source: Schreibblöcke
en: Writing tablets

source: Debitkarten ohne Magnetkodierung
en: Debit cards without magnetic coding

source: Kupons
en: Coupons

source: Entfernbare Tattoos [Abziehbilder]
en: Removable tattoos [decalcomania]

source: Datenverarbeitungsprogramme in gedruckter Form
en: Data processing programmes in printed form

source: Verzierungen in Form von Abziehbildern
en: Appliques in the form of decals

source: Gedruckte Reklame
en: Printed advertisements

source: Japanische zeremonielle Papierstreifen [Mizuhiki]
en: Japanese ceremonial paper strings (mizuhiki)

source: Korrekturbänder für Schreibmaschinen
en: Typewriter correction ribbons

source: Weißwandtafeln mit magnetischen Eigenschaften
en: Whiteboards having magnetic properties

source: Briefbögen [Fertigprodukte]
en: Gunpowder wrapping paper

source: Buchbindegeräte und -maschinen [Büroausstattung]
en: Bookbinding apparatus and machines [office equipment]

source: Lesebücher
en: Story books

source: Gerahmte oder ungerahmte Bilder [Gemälde]
en: Paintings [pictures], framed or unframed

source: Zeitungen
en: Newspapers

source: Wandtafelwischer [Kreideentferner]
en: Blackboard erasers [chalk erasers]

source: Elektrische Hefter für das Büro
en: Electric staplers for offices

source: Klebstoffe für Bastelarbeiten oder Büro- und Haushaltszwecke
en: Paste for handicraft, for stationery or household purposes (banjaku-nori)

source: Seidenpapier zur Verwendung als Material für Schablonenpapier [Ganpishi]
en: Tissue paper for use as material of stencil paper (ganpishi)

source: Kurvenschablonen [Zeicheninstrumente]
en: Curve templates [drawing instruments]

source: Verpackungsbeutel aus Luftkissenfolie
en: Bags of bubble plastics for packaging

source: Malkästen und -pinsel
en: Paint boxes and brushes

source: Gepolsterte Papptüten
en: Padded bags of card

source: Gedruckte Zertifikate
en: Printed certificates

source: Gedruckte Einladungen
en: Printed invitations

source: Xerografisches Papier
en: Xerographic paper

source: Lithografische Gravuren
en: Lithographic engravings

source: Bürogeräte zum Adressieren von Post
en: Machines for office use in addressing mail

source: Modelliermaterial für Künstler
en: Artists' modelling materials

source: Malpinsel zum Auftragen von Farben
en: Brushes for the application of paints

source: Krepppapier
en: Crepe paper

source: Stifte mit Glitteranteilen für Schreibzwecke
en: Glitter pens for stationery purposes

source: Plakate aus Papier und Pappe
en: Placards of paper or cardboard

source: Verpackungsfolien aus Plastik
en: Plastic film for packaging

source: Schreibmappen [Papeteriewaren]
en: Writing cases [stationery]

source: Dekoratives Verpackungspapier
en: Decorative wrapping paper

source: Aktendeckel
en: File covers

source: Papiersäcke und -beutel
en: Paper for bags and sacks

source: Hefter
en: Binders

source: Banner aus Papier
en: Banners of paper

source: Fahnen aus Papier
en: Flags of paper

source: Fähnchen aus Papier
en: Bunting of paper

source: Schneiderschablonen zum Zeichnen
en: Dressmaking stencils for drawing

source: Schreibmaterial
en: Writing stationery

source: Adressbücher
en: Address books

source: Kopierpapier [Schreibwaren]
en: Copying paper [stationery]

source: Werbetafeln aus Pappe
en: Advertisement boards of card

source: Werbeschilder aus Karton
en: Advertising signs of cardboard

source: Farbstifte
en: Color pencils

source: Gästebücher
en: Guest books

source: Schachteln aus Papier oder Pappe
en: Boxes of paper or cardboard

source: Bücher
en: Books

source: Memo-Blöcke
en: Note pads

source: Flyer
en: Flyers

source: Papierblätter [Papeteriewaren]
en: Paper sheets [stationery]

source: Alben
en: Albums

source: Briefbögen
en: Notepaper

source: Lineale
en: Rulers

source: Briefpapier
en: Writing paper

source: Reiseführer
en: Guide books

source: Lehrbücher
en: Textbooks

source: Papier und Pappe
en: Paper and cardboard

source: Schreib- und Stempelausrüstung
en: Writing and stamping implements

source: Korrektur- und Radierartikel
en: Correcting and erasing implements

source: Druck- und Buchbindeausrüstung
en: Printing and bookbinding equipment

source: Papier und Pappe [industriell]
en: Industrial paper and cardboard

source: Kunstwerke und Figuren aus Papier oder Pappe sowie Architekturmodelle
en: Works of art and figurines of paper and cardboard, and architects' models

source: Taschen, Beutel und Waren für Verpackungs-, Einpack- und Ablagezwecke aus Papier, Pappe oder Kunststoff
en: Bags and articles for packaging, wrapping and storage of paper, cardboard or plastics

source: Gedruckte Horoskope
en: Printed horoscopes

source: Gepäckanhänger aus Papier
en: Luggage tags of paper

source: Gepäckanhänger aus Karton
en: Luggage tags of cardboard

source: Zeitungspapier
en: Newsprint paper

source: Griffe aus Kunststoff für Farbpinsel
en: Handles made of plastics for paint brushes

source: Klebestoffe für Bürozwecke
en: Adhesive materials for office use

source: Do-it-yourself-Klebstoffe [Bastelbedarf]
en: Adhesives for do-it-yourself purposes

source: Buchbindermaschinen für Bürozwecke
en: Bookbinding machines for office use

source: Satiniertes Papier
en: Calendered paper

source: Leinwandkeilrahmen für Künstler
en: Canvas stretcher bars for artists

source: Dokumentenhüllen in Form von Heftern
en: Document folders in the form of wallets

source: Gelatineklebstoffe für Büro- oder Haushaltszwecke
en: Gelatine glue for stationery or household purposes

source: Klebstoffe aus Gummiarabikum für Büro- oder Haushaltszwecke
en: Gum arabic glue for stationery or household purposes

source: Nachfüllpatronen für Füller
en: Ink pen refill cartridges

source: Latexklebstoff für Büro- oder Haushaltszwecke
en: Latex glue for stationery or household purposes

source: Modellierton für Kinder
en: Modeling clay for children

source: Muster aus Papier
en: Paper patterns

source: Kunststoffklebstoffe für Büro- oder Haushaltszwecke
en: Plastic adhesives for stationery or household purposes

source: Baseballkartenhüllen aus Plastik
en: Plastic baseball card holders

source: Bedruckte Werbetafeln aus Pappe
en: Printed advertising boards of cardboard

source: Bedruckte Werbetafeln aus Papier
en: Printed advertising boards of paper

source: Gedruckte Zeitschriften aus dem Bereich Tanz
en: Printed periodicals in the field of dance

source: Gedruckte Zeitschriften aus dem Bereich bildende Kunst
en: Printed periodicals in the field of figurative arts

source: Gedruckte Zeitschriften im Bereich Film
en: Printed periodicals in the field of movies

source: Gedruckte Zeitschriften im Bereich Theaterstücke
en: Printed periodicals in the field of plays

source: Gedruckte Zeitschriften im Bereich Tourismus
en: Printed periodicals in the field of tourism

source: Geodreiecke als Zeichengeräte
en: Protractors as drawing instruments

source: Stahlfedern
en: Steel pens

source: Kohlepapier
en: Carbon paper

source: Metallisches Geschenkpapier
en: Metallic gift wrapping paper

source: Fotografien [Abzüge]
en: Photographs [printed]

source: Federkästen
en: Pen cases

source: Schilder [Papiersiegel]
en: Shields [paper seals]

source: Kugeln für Kugelschreiber
en: Balls for ball-point pens

source: Wandtafeln
en: Blackboards

source: Karteikarten
en: Record cards

source: Etikettiergeräte für Büros
en: Office labeling machines

source: Patronen für Stifte
en: Pen ink cartridges

source: Papiertüten
en: Paper bags

source: Klebstoffe für Papier- und Schreibwaren oder für Haushaltszwecke
en: Pastes and other adhesives for stationery or household purposes

source: Grafische Darstellungen
en: Graphic representations

source: Stempelkissen
en: Inking pads

source: Comic-Hefte
en: Comic books

source: Lochzangen [Büroartikel]
en: Punches [office requisites]

source: Locher [Büroartikel]
en: Office perforators

source: Locher für Bürozwecke
en: Office hole punchers

source: Grafische Reproduktionen
en: Graphic reproductions

source: Pappdeckel
en: Pasteboard

source: Hygienische Handtücher aus Papier
en: Hygienic hand towels of paper

source: Versenkbare Bleistifte
en: Retractable pencils

source: Ordner [Büroartikel]
en: Files [office requisites]

source: Falzmesser [Büroartikel]
en: Folders [stationery]

source: Füllfederhalter
en: Fountain pens

source: Zeichenblöcke
en: Drawing pads

source: Notizbücher
en: Note books

source: Skizzenbücher
en: Sketchbooks

source: Polstermaterial [Verpackung] aus Papier oder Pappe
en: Packing [cushioning, stuffing] materials of paper or cardboard

source: Füllmaterial aus Papier oder Pappe
en: Stuffing of paper or cardboard

source: Reproduktionen von Gemälden
en: Reproductions of paintings

source: Sift- und Füllfederetuis
en: Pen and pencil cases

source: Stift- und Füllfederhalter
en: Pen and pencil holders

source: Gedruckte Muster für die Schneiderei
en: Printed patterns for dressmaking

source: Schnittmuster
en: Sewing patterns

source: Handbetätigte Kreditkartenabdruckgeräte
en: Manually operated credit card imprinters

source: Kunstwerke aus Papier
en: Works of art made of paper

source: Papierbeutel für Haushaltszwecke
en: Paper bags for household use

source: Plastiksäcke für Haushaltszwecke
en: Plastic bags for household use

source: Foto- oder Kunstrahmen
en: Photographic or art mounts

source: Buttons aus Karton
en: Cardboard badges

source: Griffe für Farbroller
en: Paint roller handles

source: Handetikettendrucker [Büroartikel]
en: Handheld label printers [office requisites]

source: Bänder für Handetikettendrucker [Büroartikel]
en: Ribbons for handheld label printers [office requisites]

source: Klebeetiketten aus Papier
en: Adhesive labels of paper

source: Illustrierte Wandkarten für Unterrichtszwecke
en: Illustrated wall maps for educational purposes

source: Illustrierte Wandkarten
en: Illustrated wall maps

source: Elektrische Brieföffner
en: Electric letter openers

source: Thekendisplays aus Karton
en: Display boxes of cardboard

source: Manila-Papier
en: Manila paper

source: Gedruckte Lehrpläne
en: Printed curricula

source: Gedruckte Informationsprospekte
en: Printed informational folders

source: Gedruckte Informationskarten
en: Printed informational cards

source: Handbemalte Weinflaschenetiketten aus Papier
en: Handpainted paper wine bottle labels

source: Gedrucktes Unterrichtsmaterial
en: Printed training materials

source: Verpackungsmaterial aus Recyclingpapier
en: Packaging materials made of recycled paper

source: Leere Papiernotizbücher
en: Blank paper notebooks

source: Aufbewahrungsboxen für Zeitschriften
en: File boxes for storage of magazines

source: Verpackungsmaterial aus Kunststoff für Sandwiches
en: Packaging materials of plastic for sandwiches

source: Kunststoffseiten mit Einschüben für Sammelkarten
en: Plastic pages with pockets for holding trading cards

source: Kunststoffseiten mit Einschüben für Rezeptkarten
en: Plastic pages with pockets for holding receipts

source: WC-Sitzabdeckungen aus Papier
en: Paper toilet bowl liners

source: Papierbehälter zur Aufbewahrung von Grußkarten
en: Paper boxes for storing greeting cards

source: Bleistiftanspitzer, mechanisch
en: Mechanical pencil sharpeners

source: Gedruckte Verbraucherberichte
en: Printed consumer reports

source: Magnettafeln zur Aktivitäten- und Terminplanung
en: Magnetic boards for scheduling activities and appointments

source: Logbücher [Buchhaltung]
en: Logbooks [book-keeping]

source: Bedienungshandbücher für Fitnessgeräte
en: Instruction manuals for exercise equipment

source: Bedienungshandbücher für Musiksynthesizer
en: Instruction manuals for music synthesizers

source: Dekorative Papiergirlanden für Partys
en: Decorative paper garlands for parties

source: Plastikbeutel zur Sicherung von Wertsachen
en: Plastic bags for securing valuables

source: Aufbügelbilder aus Papier
en: Iron-on transfers of paper

source: Broschüren im Bereich des Immobilienverkaufs
en: Brochures in the field of real estate sales

source: Verpackungsbehälter aus regeneriertem Zellstoff
en: Packaging containers of regenerated cellulose

source: Ausrüstung für Rollenspiele in Form von Spielehandbüchern
en: Role playing game equipment in the nature of manuals

source: Studienführer
en: Study guides

source: Typelemente für Schreibmaschinen
en: Typewriter typing elements

source: Behandeltes Papier zum Einwickeln von Blumen und Blumengebinden
en: Treated paper for wrapping flowers and floral displays

source: Dreidimensionale Modelle für Unterrichtszwecke
en: Three dimensional models for educational purposes

source: Hochkalandriertes Druckpapier
en: Supercalendered printing paper

source: Serie von Sachbüchern
en: Series of non-fiction books

source: Dokumentenstempel aus Gummi
en: Rubber document stamps

source: Gedruckte Forschungsberichte
en: Printed research reports

source: Religiöse Rundschreiben
en: Religious circular letters

source: Religiöse Bücher
en: Religious books

source: Gedruckte Fragebögen
en: Printed questionnaires

source: Gedruckte Führer für den Lehrbetrieb
en: Printed teaching activity guides

source: Gedruckte Rezepte als Teile von Lebensmittelverpackungen
en: Printed recipes sold as a component of food packaging

source: Gedruckte Briefantwortkarten
en: Printed mail response cards

source: Gedruckte Vorträge
en: Printed lectures

source: Gedrucktes Lehrmaterial bezüglich Telekommunikation
en: Printed instructional material on telecommunications

source: Bedruckte Grußkarten mit eingespeicherten elektronischen Informationen
en: Printed greeting cards with electronic information stored therein

source: Gedruckte Embleme
en: Printed emblems

source: Gedruckte Materialen für Fernkurse
en: Printed correspondence course materials

source: Gedruckte Antwortbögen
en: Printed answer sheets

source: Kunststoffseiten mit Einschüben für Fotografien
en: Plastic pages with pockets for holding photographs

source: Bildhalter aus Pappe
en: Cardboard picture mounts

source: Seiten für Fotoalben
en: Photograph album pages

source: Unbedruckte Pappe
en: Paperboard blanks

source: Papierregale [Büroartikel]
en: Paper racks [office requisites]

source: Papiermatten zum Wechseln von Windeln
en: Paper pads for changing diapers

source: Passepartouts aus Papier
en: Paper passe-partouts

source: Papier für die Herstellung von Teebeuteln
en: Paper for use in the manufacture of tea bags

source: Fächermappen aus Papier
en: Paper expanding files

source: Verpackungsumschläge aus Papier
en: Paper envelopes for packaging

source: Papierkartons für den Warenversand
en: Paper cartons for delivering goods

source: Farbapplikatoren in der Form von Schwämmen
en: Paint applicators in the nature of sponges

source: Trenngeräte für das Büro
en: Office decollating machines

source: Fassungen für Röntgennegative für nicht-medizinische Zwecke
en: Mounts for X-ray negatives for non-medical purposes

source: Monographien
en: Monographs

source: Flugbücher [Luftfahrt]
en: Logbooks [aviation]

source: Lederhüllen für Terminkalender
en: Leather appointment book covers

source: Drucktücher zur Verwendung bei der Bildreproduktion in der Druckindustrie
en: Ink sheets for use in reproducing images in the printing industry

source: Informationsbriefe
en: Informational letters

source: Allgemeine Magazine
en: General feature magazines

source: Etuis für Flipcharts
en: Flip chart cases

source: Trageetuis für Flipcharts
en: Flip chart carrying cases

source: Elektrische Holzbrennstifte für Künstler
en: Electrical wood burning artists' pens

source: Tabletts für Zeicheninstrumente
en: Trays for holding drawing instruments

source: Tabletts für Skizzierinstrumente
en: Trays for holding drafting instruments

source: Drehkarteien für den Schreibtisch
en: Desktop revolving rotary card files

source: Schreibtischkörbe für Schreibtischzubehör
en: Desk baskets for desk accessories

source: Dekorative Aufkleber für Helme
en: Decorative stickers for helmets

source: Krepppapier für Haushaltszwecke
en: Crepe paper for domestic use

source: Zusammenträger für Bürozwecke
en: Collators for office use

source: Collagen
en: Collages

source: Branchenverzeichnisse
en: Classified directories

source: Tragetüten aus Papier
en: Carrying cases made of paper

source: Karikaturen
en: Caricatures

source: Leere Notizkarten
en: Blank note cards

source: Automatische Büroklammerspender für Büro oder Schreibwaren
en: Automatic paper clip dispensing machines for office or stationery use

source: Seiten für die Archivierung
en: Archival storage pages

source: Anatomische Modelle für Lehr- und Bildungszwecke
en: Anatomical models for instructional and educational purposes

source: Selbstklebefolie aus Kunststoff zum Anbringen von Bildern
en: Adhesive plastic film used for mounting images

source: Papier für Aktienzertifikate
en: Stock certificate paper

source: Bedruckte Flipcharts
en: Printed flip charts

source: Leere Schultüten
en: School cones, empty

source: Schreibpinsel für die Kalligrafie
en: Writing brush for calligraphy

source: Broschüren
en: Brochures

source: Schilder aus Papier
en: Paper signboards

source: Gedruckte Gutscheine
en: Printed vouchers

source: Ständer für Aktenordner
en: Document file racks

source: Gedruckte Diagramme
en: Printed diagrams

source: Gedruckte Pläne
en: Printed plans

source: Skizzen
en: Sketches

source: Arbeitshefte mit Übungen
en: Workbooks containing exercises

source: Aktenhalter [Büroartikel]
en: File sorters [office requisites]

source: InformationsblÃ¤tter
en: Informational sheets

source: Kleinalben [Fotoalben]
en: Brag books [photo albums]

source: Datenbücher
en: Data books

source: Gedruckte Musikbücher
en: Printed music books

source: Papierbeutel für Speiseabfälle für Haushaltszwecke
en: Food waste bags of paper for household use

source: Abfallbeutel aus Vinyl für Haushaltszwecke
en: Garbage bags of vinyl for household use

source: Jahrbücher [gedruckte Publikationen]
en: Annuals [printed publications]

source: Lesezeichen, nicht aus Edelmetall
en: Bookmarks, not of precious metal

source: Etiketten aus Pappe
en: Cardboard labels

source: Pizzaschachteln aus Pappe
en: Cardboard pizza boxes

source: Gedenkstempel [Siegel]
en: Commemorative stamps [seals]

source: Hüllen für Wochenkalender
en: Covers for weekly planners

source: Textilklebstoffe für Haushaltszwecke
en: Fabric glue for household use

source: Tinte für Füllfederhalter
en: Ink for fountain pens

source: Lesezeichen aus Leder
en: Leather bookmarks

source: Federmäppchen aus Leder
en: Leather pencil cases

source: Wegwerf-Saugunterlagen für Haustiere
en: Disposable absorbent underpads for pets

source: Party-Geschenkschachteln aus Pappe
en: Party favor boxes of cardboard

source: Kunststofffolien als Rollenware zum Verpacken von Pharmazeutika
en: Plastic film roll stock for packaging pharmaceuticals

source: Gedruckte Broschüren
en: Printed brochures

source: Gedruckte Einladungskarten aus Pappe
en: Printed cardboard invitations

source: Gedruckte Informationsblätter
en: Printed information sheets

source: Gedruckte Mitteilungsblätter
en: Printed informational sheets

source: Mit Tischnummern bedruckte Papierschilder zur Verwendung für spezielle Veranstaltungen
en: Printed paper signs featuring table numbers for use for special events

source: Gedruckte Werbematerialien
en: Printed promotional material

source: Gedruckte Veröffentlichungen in Bezug auf Computer
en: Printed publications relating to computers

source: Gedrucktes Briefpapier
en: Printed stationery

source: Signierte Fotografien
en: Signed photographs

source: Flaschenverpackungen aus Papier oder Pappe
en: Bottle wrappers of paper or cardboard

source: Flaschenhüllen aus Papier oder Pappe
en: Bottle envelopes of paper or cardboard

source: Lithografische Kunstgegenstände
en: Lithographic works of art

source: Strategieanleitungsbücher für Computerspiele
en: Strategy guide books for computer games

source: Magazine für Video- und Computerspiele
en: Magazines featuring video and computer games

source: Bögen aus Papier zum Einpacken
en: Sheets for wrapping made of paper

source: Bögen aus Kunststoffmaterialien zum Einpacken
en: Sheets for wrapping made of plastic material

source: InformationsblÃ¤tter im Bereich Spiele
en: Newsletters in the fields of games and gaming

source: Nicht magnetisch kodierte Prepaid-Einkaufskarten
en: Pre-paid purchase cards, not magnetically encoded

source: Papierauflagen für Toiletten für Haustiere
en: Liners of paper for toilet trays for domestic animals

source: Kunststoffauflagen für Toiletten für Haustiere
en: Liners of plastic for toilet trays for domestic animals

source: Kunststoffauflagen für Haustierstreukästen
en: Liners of plastic for toilet boxes for domestic animals

source: Teefilter aus Papier
en: Paper tea filters

source: Kundenkarten aus Papier
en: Paper loyalty cards

source: Mit Wasser beschreibbare Tücher für Kalligrafieübungen
en: Water-writing cloths for calligraphy practice

source: Bambusrollen zur Verwendung als Schreibpinselhalter
en: Bamboo rolls used as writing brush holders

source: Duftende Modelliermaterialien
en: Aromatic modeling materials

source: Malhandschuhe zum Auftragen von Farben
en: Painting mitts for applying paint

source: Dekorative Aufkleber für Schuhsohlen
en: Decorative stickers for soles of shoes

source: Manila-Mappen
en: Manila folders

source: Selbstklebende Buchstaben und Zahlen aus Vinyl
en: Adhesive-backed vinyl letters and numbers

source: Omikuji [mit Wahrsagungen bedruckte Papierstreifen als Orakelzettel]
en: Omikuji [sacred lots] [printed strips of paper used for fortune telling]

source: Gedruckte Bücher auf dem Gebiet der Musikerziehung
en: Printed books in the field of music education

source: Vierkantlineale zum Zeichnen
en: Square rulers for drawing

source: CD-Schredder für Haushalt und Büro
en: CD shredders for home or office use

source: Ausmalbücher für Erwachsene
en: Coloring books for adults

source: Waschschalen für Schreibpinsel
en: Writing brush washing saucers

source: Tischläufer aus Zellulose
en: Table runners of cellulose

source: Lesezeichen aus Papier
en: Paper book markers

source: Papierrüttelmaschinen für Bürozwecke
en: Paper jogging machines for office use

source: Sicherheitsvorhänge aus Asbest
en: Asbestos safety curtains

source: Dichtungen für Rohrverbindungen
en: Seals for pipe connections

source: Stoßdämpfende Gummipuffer für die industrielle Maschinerie
en: Shock absorbing rubber buffers for industrial machinery

source: Gummi für die Runderneuerung von Reifen
en: Rubber material for recapping tires [tyres]

source: Asbest
en: Asbestos

source: Mineralwolle [Isoliermittel]
en: Mineral wool [insulator]

source: Polyurethanschaum in Teilstücken zur Verwendung in der Produktion
en: Polyurethane foam in sections for use in manufacture

source: Isolieröl für Transformatoren
en: Insulating oil for transformers

source: Isoliermanschetten für Wassererhitzer
en: Insulating sleeves for water heaters

source: Leichte Mineralwollplatten für Schalldämmungszwecke
en: Lightweight mineral wool slabs for acoustic insulation purposes

source: Vulkanisierbare Niedrigtemperatur-Gummimischungen
en: Low temperature vulcanizable rubber compounds
